Repository: Gavalencia12/Sign_Language_App
Catalog: speakhands_mobile/lib/l10n/app_*.arb
Languages: es

# select_language
source: Select a language
es: Selecciona un idioma

# len_es
source: Spanish
es: Español

# len_en
source: English
es: Inglés

source: Clear
es: Borrar

source: Dictate
es: Dictar

source: Speak text
es: Leer texto

source: Stop audio
es: Detener audio

# interpreter_screen_title
source: Interpreter
es: Intérprete

# let_your_sign_be_heard
source: Let your signs be heard
es: Que tus señas se escuchen

# learn_info
source: This is the section to learn sign language.
es: Esta es la sección para aprender lengua de señas.

# saying
source: Let your hands do the talking
es: Deja que tus manos hablen

# translator_screen_title
source: Translate
es: Traductor

source: Let your hands speak
es: Deja que tus manos hablen

source: Translation:
es: Traducción:

# waiting_prediction
source: Waiting for prediction...
es: Esperando predicción...

source: Camera not active
es: Cámara no activa

# detected_letter
source: Detected letter: {letter}
es: Letra detectada: {letter}

source: No hand detected
es: No se detectó mano

# camera_toggle_on
source: Camera turned ON
es: Cámara activada

# camera_toggle_off
source: Camera turned OFF
es: Cámara desactivada

# reset_message
source: Resetting translation
es: Reiniciando traducción

# pause_explanation
source: Pausing translation
es: Pausando traducción

# screen_intro
source: Welcome to the translator screen
es: Bienvenido a la pantalla de traductor

# subtitle_intro
source: Show your hands to the camera
es: Muestra tus manos a la cámara

# settings_title
source: Settings
es: Ajustes

# account_section
source: Account
es: Cuenta

source: Personal Data
es: Datos personales

source: Account
es: Cuenta

source: Privacy Policy
es: Política de privacidad

# accessibility_section
source: Accessibility
es: Accesibilidad

source: Language
es: Idioma

# color
source: Appearance
es: Apariencia

# dark_mode
source: Current Theme: Dark
es: Tema actual: Oscuro

# sure_mode
source: Current Theme: Light
es: Tema actual: Claro

# sistem_mode
source: Current Theme: System
es: Tema actual: Sistema

source: Select Theme
es: seleccionar Tema

source: Dark
es: Oscuro

source: Light
es: Claro

# system
source: Predetermined by System
es: Predeterminado del sistema

source: Accessibility
es: Accesibilidad

# help_information_section
source: Help & Information
es: Ayuda e Información

source: Terms and Conditions
es: Términos y condiciones

# speech_text
source: Speech for text
es: Lectura por voz

# download_tittle
source: Download files to use in offline mode
es: Descargar archivos para usar en modo offline

source: Download
es: Descargar

# download_information
source: Download videos and images for offline use
es: Descarga videos e imágenes para uso sin conexión

# download_init
source: Starting download...
es: Iniciando descarga...

# download_no_files
source: No files found to download.
es: No se encontraron archivos para descargar.

# download_progress
source: Downloading... {percent}%
es: Descargando... {percent}%

# download_complete
source: Download complete! ({downloaded} files)
es: ¡Descarga completa! ({downloaded} archivos)

# download_error
source: Fatal error: {error}
es: Error fatal: {error}

source: Hello
es: Hola

source: Show
es: Mostrar

# modal_1
source: Welcome to the LSM Translator
es: Bienvenido al Traductor de LSM

# modal_1_text
source: Use the camera to translate your gestures in real time. Make sure you have good lighting.
es: Usa la cámara para traducir tus gestos en tiempo real. Asegúrate de tener buena iluminación.

# modal_2
source: Place your hands inside the camera frame.
es: Coloca tus manos dentro del recuadro de la cámara.

# modal_3
source: Voice translation
es: Traducción con voz

# modla_3_text
source: The system can pronounce the detected letters or words. You can activate or pause it whenever you want.
es: El sistema puede pronunciar las letras o palabras detectadas. Puedes activarlo o pausarlo cuando quieras.

# modal_1_interpreter
source: Welcome to the LSM Interpreter
es: Bienvenido al Intérprete de LSM

# modal_1_interpreter_text
source: Use the text input to get the sign language interpretation in real time. Type clearly.
es: Usa el campo de texto para obtener la interpretación en lengua de señas en tiempo real. Escribe con claridad.

# modal_2_interpreter
source: Type the text you want to interpret.
es: Escribe el texto que deseas interpretar.

# modal_3_interpreter
source: Voice interpretation
es: Interpretación con voz

# modal_3_interpreter_text
source: The system can read aloud the interpreted text. You can activate or pause it whenever you want.
es: El sistema puede leer en voz alta el texto interpretado. Puedes activarlo o pausarlo cuando quieras.

# privacy_policy_title
source: Privacy Policy
es: Política de Privacidad

# error_loading_data
source: Error loading data. Please try again.
es: Error al cargar los datos. Inténtalo nuevamente.

# effective_date
source: May 25, 2025
es: 25 de Mayo de 2025

# section_1_title
source: 1. Information We Collect
es: 1. Información que recopilamos

# section_1_content
source: To translate signs, the app needs access to your device's camera. SpeakHands does not store or transmit images, videos, or personal data captured by the camera without your explicit consent. Non-identifiable data about app usage (errors, performance, usage statistics).
es: Para traducir señas, la aplicación necesita acceso a la cámara de tu dispositivo. SpeakHands no almacena ni transmite imágenes, videos o datos personales capturados por la cámara sin tu consentimiento explícito. Datos no identificables sobre el uso de la aplicación (errores, rendimiento, estadísticas de uso).

# section_2_title
source: 2. Use of Information
es: 2. Uso de la información

# section_2_content
source: The information is used solely to: - Recognize gestures and translate them. - Improve app performance. - Fix bugs or errors.
es: La información se utiliza únicamente para: - Reconocer gestos y traducirlos. - Mejorar el rendimiento de la app. - Corregir errores o fallos.

# section_3_title
source: 3. Sharing of Information
es: 3. Compartición de información

# section_3_content
source: SpeakHands does not share or sell personal data to third parties. No images or user data are uploaded to external servers.
es: SpeakHands no comparte ni vende datos personales a terceros. No se suben imágenes o datos del usuario a servidores externos.

# section_4_title
source: 4. Permissions
es: 4. Permisos

# section_4_content
source: The app requests permissions only to use the camera, necessary for basic functionality. You can revoke these permissions at any time from your device settings.
es: La aplicación solicita permisos únicamente para usar la cámara, necesarios para el funcionamiento básico. Puedes revocar estos permisos en cualquier momento desde la configuración de tu dispositivo.

# section_5_title
source: 5. Minors
es: 5. Menores de Edad

# section_5_content
source: The app is not intended for use by minors under the age of 13 without the consent of a responsible adult.
es: La aplicación no está diseñada para ser utilizada por menores de 13 años sin el consentimiento de un adulto responsable.

# section_6_title
source: 6. Security
es: 6. Seguridad

# section_6_content
source: We use technical and organizational measures to protect your information from unauthorized access, alteration, or loss.
es: Utilizamos medidas técnicas y organizativas para proteger tu información contra accesos no autorizados, alteraciones o pérdidas.

# section_7_title
source: 7. User Rights
es: 7. Derechos del usuario

# section_7_content
source: You can: - Request the deletion of your data at any time. - Access this policy from the app. - Contact us for questions or complaints at [languageappsign@gmail.com](mailto:languageappsign@gmail.com).
es: Puedes: - Solicitar la eliminación de tus datos en cualquier momento. - Acceder a esta política desde la aplicación. - Contactarnos para dudas o reclamos a [languageappsign@gmail.com](mailto:languageappsign@gmail.com).

# terms_title
source: Terms and Conditions
es: Términos y Condiciones

# terms_section_1_title
source: 1. Acceptance of Terms
es: 1. Aceptación de los términos

# terms_section_1_content
source: By downloading, accessing, or using SpeakHands, you agree to these Terms and Conditions in full. If you do not agree, you must not use the application.
es: Al descargar, acceder o utilizar SpeakHands, aceptas estos Términos y Condiciones en su totalidad. Si no estás de acuerdo con ellos, no deberás usar la aplicación.

# terms_section_2_title
source: 2. Permitted Use
es: 2. Uso permitido

# terms_section_2_content
source: The application is intended solely for personal, educational, or communicative support purposes. You agree not to use it for illegal activities or those infringing on third-party rights. Offensive or discriminatory content generation is prohibited.
es: La aplicación está destinada únicamente a fines personales, educativos o de apoyo comunicativo. El usuario se compromete a no utilizar la aplicación para actividades ilegales o que infrinjan derechos de terceros. No se debe usar la aplicación para generar contenido ofensivo o discriminatorio.

# terms_section_3_title
source: 3. Intellectual Property
es: 3. Propiedad intelectual

# terms_section_3_content
source: All copyrights, logos, trademarks, and technologies used in SpeakHands are the property of the development team and are protected by intellectual property laws.
es: Todos los derechos de autor, logotipos, marcas y tecnologías utilizadas en SpeakHands son propiedad del equipo desarrollador y están protegidos por las leyes de propiedad intelectual.

# terms_section_4_title
source: 4. Service Modifications
es: 4. Modificaciones al servicio

# terms_section_4_content
source: We reserve the right to modify or temporarily or permanently suspend the service without prior notice. This includes updates, technical, or functionality changes.
es: Nos reservamos el derecho de modificar o suspender temporal o permanentemente el servicio sin previo aviso. Esto incluye actualizaciones, cambios técnicos o de funcionalidad.

# terms_section_5_title
source: 5. Limitation of Liability
es: 5. Limitación de responsabilidad

# terms_section_5_content
source: SpeakHands is provided 'as is'. We do not guarantee absolute accuracy in sign interpretation. SpeakHands will not be responsible for direct or indirect damages derived from the use or misuse of the app, including translation errors or misinterpretations.
es: SpeakHands se proporciona 'tal cual'. No garantizamos una precisión absoluta en la interpretación de señas. SpeakHands no será responsable de daños directos o indirectos derivados del uso o mal uso de la aplicación, incluyendo errores en la traducción o malinterpretaciones.

# terms_section_6_title
source: 6. Termination of Use
es: 6. Terminación del uso

# terms_section_6_content
source: We reserve the right to suspend access to the app for any user who violates these terms, without prior notice.
es: Nos reservamos el derecho de suspender el acceso a la aplicación a cualquier usuario que incumpla estos términos, sin necesidad de previo aviso.

# help_title
source: Help
es: Ayuda

source: Search questions...
es: Buscar preguntas...

# faq_title
source: Frequently Asked Questions (FAQ)
es: Preguntas frecuentes (FAQ)

# no_results_found
source: We found no results for your search.
es: No hemos encontrado resultados para tu búsqueda.

source: See more
es: Ver más

# need_more_help
source: Need more help? Contact us!
es: ¿Necesitas más ayuda? ¡Contáctanos!

# email_app_not_found
source: No email application found.
es: No se encontró una aplicación de correo configurada.

# phone_call_failed
source: Could not start the phone call.
es: No se pudo realizar la llamada.

# faq_q01
source: I can’t open the email link
es: No puedo abrir el enlace de correo

# faq_q01_a1
source: Install and set up an email app (Gmail/Outlook).
es: Instala y configura una app de correo (Gmail/Outlook).

# faq_q01_a2
source: Settings > Default apps > Email: select your client.
es: Ajustes > Apps predeterminadas > Correo: selecciona tu cliente.

# faq_q01_a3
source: Try on a physical device (emulators usually don’t have email).
es: Prueba en un dispositivo físico (los emuladores suelen no tener correo).

# faq_q02
source: How can I reset my password?
es: ¿Cómo puedo restablecer mi contraseña?

# faq_q02_a1
source: Go to Profile > Account > Reset password.
es: Ve a Perfil > Cuenta > Restablecer contraseña.

# faq_q02_a2
source: Check your email (spam) for the reset link.
es: Revisa tu correo (spam) para el enlace de restablecimiento.

# faq_q02_a3
source: If it doesn’t arrive, try again or contact us by email.
es: Si no llega, intenta de nuevo o contáctanos por correo.

# faq_q03
source: How do I change my email address?
es: ¿Cómo cambio mi dirección de correo electrónico?

# faq_q03_a1
source: Profile > Personal data > Email.
es: Perfil > Datos personales > Correo electrónico.

# faq_q03_a2
source: Verify the new email using the link you received.
es: Verifica el nuevo correo desde el enlace recibido.

# faq_q03_a3
source: Log out and back in if you don’t see the change.
es: Cierra sesión y vuelve a entrar si no ves el cambio.

# faq_q04
source: What should I do if I have a technical issue?
es: ¿Qué hacer si tengo un problema técnico?

# faq_q04_a1
source: Close and reopen the app.
es: Cierra y vuelve a abrir la app.

# faq_q04_a2
source: Restart the device.
es: Reinicia el dispositivo.

# faq_q04_a3
source: Update to the latest version available.
es: Actualiza a la última versión disponible.

# faq_q05
source: The camera isn’t working
es: La cámara no funciona

# faq_q05_a1
source: Make sure camera permissions are granted in Settings.
es: Asegúrate de haber concedido los permisos de cámara en Ajustes.

# faq_q05_a2
source: Close other apps that may be using the camera.
es: Cierra otras aplicaciones que puedan estar usando la cámara.

# faq_q05_a3
source: Try restarting the app or device.
es: Prueba a reiniciar la app o el dispositivo.

# faq_q05_a4
source: Make sure the camera is clean and unobstructed.
es: Revisa que tu cámara esté limpia y sin obstrucciones.

# faq_q06
source: The app is not responding
es: La aplicación no responde

# faq_q06_a1
source: Close and reopen the app.
es: Cierra y vuelve a abrir la aplicación.

# faq_q06_a2
source: Restart your device.
es: Reinicia tu dispositivo.

# faq_q06_a3
source: Check that you have the latest app version installed.
es: Verifica que tengas la última versión de la aplicación instalada.

# faq_q06_a4
source: If it persists, try uninstalling and reinstalling the app.
es: Si el problema persiste, intenta desinstalar y reinstalar la aplicación.

# faq_q07
source: The app doesn’t detect hands
es: La app no detecta las manos

# faq_q07_a1
source: Make sure you’re in a well-lit place.
es: Asegúrate de estar en un lugar bien iluminado.

# faq_q07_a2
source: Keep your hands within the camera frame.
es: Mantén las manos dentro del cuadro de la cámara.

# faq_q07_a3
source: Avoid busy backgrounds that may interfere with detection.
es: Evita fondos demasiado complejos que puedan interferir con la detección.

# faq_q07_a4
source: Ensure the camera is clean.
es: Asegúrate de que la cámara esté limpia.

# faq_q08
source: The translation is incorrect
es: La traducción es incorrecta

# faq_q08_a1
source: Make sure your hand is positioned correctly within the frame.
es: Asegúrate de que tu mano esté posicionada correctamente en el cuadro.

# faq_q08_a2
source: Check that lighting is sufficient for the camera to detect signs.
es: Revisa que la iluminación sea suficiente para que la cámara pueda detectar las señas.

# faq_q08_a3
source: Try moving your hand more slowly for better detection.
es: Intenta mover la mano más lentamente para una mejor detección.

# faq_q08_a4
source: If it persists, try restarting the app.
es: Si el problema persiste, intenta reiniciar la aplicación.

# faq_q09
source: The app closes unexpectedly
es: La aplicación se cierra inesperadamente

# faq_q09_a1
source: Ensure you have enough storage space.
es: Asegúrate de tener suficiente espacio de almacenamiento en tu dispositivo.

# faq_q09_a2
source: Restart your device to free memory.
es: Reinicia tu dispositivo para liberar memoria.

# faq_q09_a3
source: If it persists, uninstall and reinstall the app.
es: Si el problema persiste, desinstala y vuelve a instalar la aplicación.

# faq_q09_a4
source: Verify the app is updated to the latest version.
es: Verifica que la aplicación esté actualizada a la última versión.

# faq_q10
source: The app can’t connect to the Internet
es: La aplicación no se conecta a Internet

# faq_q10_a1
source: Check your Internet connection (Wi-Fi or mobile data).
es: Verifica tu conexión a Internet (Wi-Fi o datos móviles).

# faq_q10_a2
source: Restart your router or device if connection issues continue.
es: Reinicia tu router o dispositivo si tienes problemas con la conexión.

# faq_q10_a3
source: Verify the app has permission to access the Internet.
es: Verifica que la app tenga permisos para acceder a Internet.

# faq_q10_a4
source: Toggle Wi-Fi or mobile data off and on again.
es: Prueba desactivando y volviendo a activar la conexión Wi-Fi o datos móviles.
